Revit 2027 API
UnitTypeId.CurrencyPerSquareFoot Property
 Cost per square foot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurrencyPerSquareFoot { get; }
Public Shared ReadOnly Property CurrencyPerSquareFoot As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurrencyPerSquareFoot {
	ForgeTypeId^ get ();
}
static member CurrencyPerSquareFoot : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace